In [1]:
import numpy as np
import pandas as pd

**Concatination of 2 dataframes**

In [2]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [3]:
pd.concat([df1,df2])

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5

In [4]:
pd.concat([df2,df1])

    A   B   C
0  A3  B3  C3
1  A4  B4  C4
2  A5  B5  C5
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [5]:
pd.concat([df1,df2],axis=1)

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

In [6]:
df3 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2']
})

df4 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [7]:
pd.concat([df4,df3])

    A   B    C
0  A3  B3   C3
1  A4  B4   C4
2  A5  B5   C5
0  A0  B0  NaN
1  A1  B1  NaN
2  A2  B2  NaN

In [8]:
pd.concat([df3,df4],axis=1)

    A   B   A   B   C
0  A0  B0  A3  B3  C3
1  A1  B1  A4  B4  C4
2  A2  B2  A5  B5  C5

In [9]:
df5 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
df6 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[5, 6, 7])

In [10]:
pd.concat([df5,df6])

      name  score
1    Alice    NaN
2      Bob    NaN
3  Charlie    NaN
5      NaN   85.0
6      NaN   90.0
7      NaN   75.0

**Merging 2 dataframes**

In [11]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60000, 80000, 65000, 70000, 90000],
    'bonus': [5000, 10000, 7000, 8000, 12000]
})

In [12]:
employees.merge(salaries,on='employee_id')

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [14]:
pd.merge(employees,salaries,on='employee_id')

   employee_id   name department  salary  bonus
0            1   John         HR   60000   5000
1            2   Anna         IT   80000  10000
2            3  Peter    Finance   65000   7000

In [15]:
pd.merge(salaries,employees,on='employee_id',how='outer')

   employee_id   salary    bonus   name department
0            1  60000.0   5000.0   John         HR
1            2  80000.0  10000.0   Anna         IT
2            3  65000.0   7000.0  Peter    Finance
3            4      NaN      NaN  Linda         IT
4            5      NaN      NaN    Bob         HR
5            6  70000.0   8000.0    NaN        NaN
6            7  90000.0  12000.0    NaN        NaN

In [16]:
pd.merge(salaries,employees,on='employee_id',how='left')

   employee_id  salary  bonus   name department
0            1   60000   5000   John         HR
1            2   80000  10000   Anna         IT
2            3   65000   7000  Peter    Finance
3            6   70000   8000    NaN        NaN
4            7   90000  12000    NaN        NaN

In [18]:
pd.merge(salaries,employees,on='employee_id',how='right')

   employee_id   salary    bonus   name department
0            1  60000.0   5000.0   John         HR
1            2  80000.0  10000.0   Anna         IT
2            3  65000.0   7000.0  Peter    Finance
3            4      NaN      NaN  Linda         IT
4            5      NaN      NaN    Bob         HR

**Joining 2 data frames**

In [19]:
student = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second DataFrame
marks = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [20]:
student.join(marks)

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0

In [21]:
marks.join(student)

   score     name
2     85      Bob
3     90  Charlie
4     75      NaN

In [26]:
student.join(marks,how='outer')

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0

In [25]:
student.merge(marks, left_index=True, right_index=True)

      name  score
2      Bob     85
3  Charlie     90